Catalogs/ПользователиСПравомАкцептаОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПользователиСПравомАкцептаОплат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРассылкиЗаявкиНаУслугиИМатериалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРассылокЗаявкиНаУслугиИМатериалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоАвансам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоЗаявкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПользователиСПравомАкцептаОплат/Ext/ManagerModule.bsl
//+++АК POZM 2018.06.07 ИП-00018682 
Функция ПолучитьСписокАктивныхАкцептантов() Экспорт
	ТекстЗапроса="ВЫБРАТЬ
	             |	ПользователиСПравомАкцептаОплат.Пользователь
	             |ИЗ
	             |	Справочник.ПользователиСПравомАкцептаОплат КАК ПользователиСПравомАкцептаОплат
	             |ГДЕ
	             |	ПользователиСПравомАкцептаОплат.Активен
	             |	И НЕ ПользователиСПравомАкцептаОплат.ПометкаУдаления
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ПользователиСПравомАкцептаОплат.Пользователь";
	Запрос = Новый Запрос(ТекстЗапроса);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Пользователь");
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	
//---АК POZM
